<a href="https://colab.research.google.com/github/Aust0/Data-Analytics-with-Python/blob/main/04_TextAnalysisRegex.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exploratory Text Analysis

## What kinds of text analysis are there?

* analyst knows the pattern
    * regular expressions
* analyst does not know the pattern
    * natural language processing
        * compares historical examples to judge novel cases
            * comparisons are statistical and approximate

### Examples of Analysis

When you know the pattern:

In [1]:
pattern = '£ ?[0-9][0-9]?' # £ then SPACE-optional then digit then digit-optional 

document = 'My eggs cost £3, bread cost £2, vodka cost £35'

In [2]:
import re

In [3]:
re.findall(pattern, document)

['£3', '£2', '£35']

If you dont:

* sentiment analysis
    * how positive/negative is this (new) review?
* topic analysis 
    * what is this document about?

## What can I do if I know what pattern I want to find?

* finding ("extracting")
    * what matches the pattern?
* matching ("validating")
    * does the entire document match YES/NO?
* substitue ("replacing")
    * replace a part that matches a pattern with another...

## How do I validate text with pandas?

In [4]:
import pandas as pd

In [6]:
ti = pd.read_csv('datasets/titanic.csv')
ti.sample(1)

     survived  pclass     sex   age  ...  deck  embark_town  alive alone
710         1       1  female  24.0  ...     C    Cherbourg    yes  True

[1 rows x 15 columns]

In [8]:
ti['ticket'] = "Ticket: " + ti['class'] + "; Price: $ " + ti['fare'].astype(str) + "; Port: " + ti['embark_town'] + ";"
print (ti['ticket'])

0       Ticket: Third; Price: $ 7.25; Port: Southampton;
1      Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2      Ticket: Third; Price: $ 7.925; Port: Southampton;
3       Ticket: First; Price: $ 53.1; Port: Southampton;
4       Ticket: Third; Price: $ 8.05; Port: Southampton;
                             ...
886    Ticket: Second; Price: $ 13.0; Port: Southampton;
887     Ticket: First; Price: $ 30.0; Port: Southampton;
888    Ticket: Third; Price: $ 23.45; Port: Southampton;
889       Ticket: First; Price: $ 30.0; Port: Cherbourg;
890      Ticket: Third; Price: $ 7.75; Port: Queenstown;
Name: ticket, Length: 891, dtype: object

In [9]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [10]:
pattern = '(First|Second)'

ti['class'].str.match(pattern)

0      False
1       True
2      False
3       True
4      False
       ...
886     True
887     True
888    False
889     True
890    False
Name: class, Length: 891, dtype: bool

In [11]:
ti.loc[ ti['class'].str.match(pattern)  , 'survived'].mean()

0.5575

## How do I extract data with pandas?

In [12]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [17]:
pattern = '([0-9.]+)'
ti['ticket'].str.extract(pattern).sample(4)

         0
0     7.25
1  71.2833
2    7.925
3     53.1

## How do I substitue text with pandas?

In [20]:
ti['ticket'].str.replace('$', '€').sample(1)

559    Ticket: Third; Price: € 17.4; Port: Southampton;
Name: ticket, dtype: object

## What are regular expressions?

Regular expressions are a language for describing patterns in text. 

They are separate from python, but may be used within python program. (And elsewhere, eg., often in SQL). 

They are notoriously difficult to read and write; and as a separate language, an additional tool to learn.

## What regular expression patterns can I use?

* literals
    * `a`, find me an `a`
    * `£`, find `£`
    * `!` means `!` 
    * ... most symbols mean "find me"
* `.`
    * find any **single** symbol 
* character classes -- find a **single** symbol
    * `[abc]` $\rightarrow$ **either** a, b, c
    * `[0-9]` $\rightarrow$ **either** 0, 1, 2, 3,...9
    * `[A-Z]` $\rightarrow$ **either** capital A, B, ... Z
    * inversions
        * `[^abc]` $\rightarrow$ **is not** `a` OR `b` OR `c`
        * `[^a-zA-Z0-9 ]`  $\rightarrow$ **is not** alphanumeric-ish
    
* alternatives -- find the character**s** given by...
    * `(May|June|July)`  $\rightarrow$ **the whole worlds** May OR June..

In [21]:
ti['ticket'].str.extract('Ticket: (First|Second)')

          0
0       NaN
1     First
2       NaN
3     First
4       NaN
..      ...
886  Second
887   First
888     NaN
889   First
890     NaN

[891 rows x 1 columns]

In [23]:
ti['ticket'].head ()

0     Ticket: Third; Price: $ 7.25; Port: Southampton;
1    Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2    Ticket: Third; Price: $ 7.925; Port: Southampton;
3     Ticket: First; Price: $ 53.1; Port: Southampton;
4     Ticket: Third; Price: $ 8.05; Port: Southampton;
Name: ticket, dtype: object

In [26]:
ti['ticket'].str.extract('( [0-9][0-9])')

       0
0    NaN
1     71
2    NaN
3     53
4    NaN
..   ...
886   13
887   30
888   23
889   30
890  NaN

[891 rows x 1 columns]

In [24]:
ti['ticket'].sample(1)

557    Ticket: First; Price: $ 227.525; Port: Cherbourg;
Name: ticket, dtype: object

In [28]:
ti['ticket'].str.extract('(Ticket: [A-Z])').sample(2)

           0
0  Ticket: T
1  Ticket: F

In [29]:
ti['ticket'].str.extract('(T........)').sample(3)

             0
617  Ticket: T
483  Ticket: T
290  Ticket: F

In [30]:
ti['ticket'].str.extract('(Price: [^0-9A-Za-z] ..)').sample(3)

               0
206  Price: $ 15
127  Price: $ 7.
362  Price: $ 14

In [33]:
ti['ticket'].str.extract('(Port: (Cherbourg|Southampton))').sample(3)

                     0            1
622    Port: Cherbourg    Cherbourg
444  Port: Southampton  Southampton
185  Port: Southampton  Southampton

* repetitions
    * optional `?`
        * an optional number: `[0-9]?`
    * one or more `+`
        * one or more spaces: ` +`  
    * optional, or more, `*`
        * ` [0-9][0-9]?.[0-9]*`

In [39]:
ti['ticket'].str.extract('([0-9][0-9]?.[0-9]*)').sample(3)

           0
111  14.4542
773    7.225
562     13.5

In [41]:
ti['ticket'].str.extract('(Ticket: [a-zA-Z]+)').sample(3)

                 0
515  Ticket: First
373  Ticket: First
783  Ticket: Third

In [116]:
row = 0
match = 1 # second match

ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+)').loc[row, match]

0    Port: Southampton
Name: (0, 1), dtype: object

In [43]:
ti['ticket'].str.extract('([a-zA-Z]+tow?n)')

               0
0    Southampton
1            NaN
2    Southampton
3    Southampton
4    Southampton
..           ...
886  Southampton
887  Southampton
888  Southampton
889          NaN
890   Queenstown

[891 rows x 1 columns]

* EXTRA: 
    * escaping
        * How do I say, literally, the `.` symbol?
        * `\.`

In [48]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

            0
713  $ 9.4833
432    $ 26.0

* positional matching
    * `^` means **at the beginning**
    * `$` means **at the end**

In [45]:
ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+;$)').sample(1)

                            0
    match
129 0      Port: Southampton;

In [49]:
ti['ticket'].str.extractall('(^[a-zA-Z]+: [a-zA-Z]+;)').sample(1)

                        0
    match
110 0      Ticket: First;

## Next Steps

* review a "Regex Cheat Sheet"
    * also, eg., https://en.wikipedia.org/wiki/Regular_expression#Examples

## Exercise (30 min)

* find all the words in the tickets 
    * HINT: a word is a repeated letter followed by a space or a colon
    * HINT: `[ :]` means a space or a colon
* find all the USD prices
    * HINT: ``` \$ ``` and repeated numbers 
    
* find all the high-price tickets
    * HINT: consider `\$`, tripple-digit number, `\.`

Solution

In [ ]:
ti['ticket'].str.findall('([a-zA-Z]+[ :])').sample(10)

372    [Ticket:, Price:, Port:]
258    [Ticket:, Price:, Port:]
752    [Ticket:, Price:, Port:]
369    [Ticket:, Price:, Port:]
478    [Ticket:, Price:, Port:]
517    [Ticket:, Price:, Port:]
461    [Ticket:, Price:, Port:]
770    [Ticket:, Price:, Port:]
455    [Ticket:, Price:, Port:]
657    [Ticket:, Price:, Port:]
Name: ticket, dtype: object

In [ ]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

             0
644  $ 19.2583
790     $ 7.75

In [79]:
ti['ticket'].str.findall('(\$ [0-9]+\.[0-9]+)').sample(5)

529       [$ 11.5]
515    [$ 34.0208]
99        [$ 26.0]
300       [$ 7.75]
145      [$ 36.75]
Name: ticket, dtype: object

In [110]:
ti['ticket'].str.extractall('(\$ [0-9][0-9][0-9]\.[0-9]+)')

                    0
    match
27  0         $ 263.0
31  0      $ 146.5208
88  0         $ 263.0
118 0      $ 247.5208
195 0      $ 146.5208
215 0       $ 113.275
258 0      $ 512.3292
268 0      $ 153.4625
269 0      $ 135.6333
297 0        $ 151.55
299 0      $ 247.5208
305 0        $ 151.55
306 0      $ 110.8833
307 0         $ 108.9
311 0       $ 262.375
318 0      $ 164.8667
319 0         $ 134.5
325 0      $ 135.6333
332 0      $ 153.4625
334 0        $ 133.65
337 0         $ 134.5
341 0         $ 263.0
373 0      $ 135.6333
377 0         $ 211.5
380 0       $ 227.525
390 0         $ 120.0
393 0       $ 113.275
435 0         $ 120.0
438 0         $ 263.0
498 0        $ 151.55
505 0         $ 108.9
527 0      $ 221.7792
537 0       $ 106.425
544 0       $ 106.425
550 0      $ 110.8833
557 0       $ 227.525
581 0      $ 110.8833
609 0      $ 153.4625
659 0       $ 113.275
660 0        $ 133.65
679 0      $ 512.3292
689 0      $ 211.3375
698 0      $ 110.8833
700 0       $ 227.525
708 0        $ 151.55
716 0       $ 227.525
730 0      $ 211.3375
737 0      $ 512.3292
742 0       $ 262.375
763 0         $ 120.0
779 0      $ 211.3375
802 0         $ 120.0
856 0      $ 164.8667

In [106]:
row = 0
match = 1 # second match

ti['ticket'].str.extractall('(\$ [0-9][0-9][0-9]+\.[0-9]+)')#.loc(row, match)

#not sure can use loc to get the full tickets as tickets not in ti

                    0
    match
27  0         $ 263.0
31  0      $ 146.5208
88  0         $ 263.0
118 0      $ 247.5208
195 0      $ 146.5208
215 0       $ 113.275
258 0      $ 512.3292
268 0      $ 153.4625
269 0      $ 135.6333
297 0        $ 151.55
299 0      $ 247.5208
305 0        $ 151.55
306 0      $ 110.8833
307 0         $ 108.9
311 0       $ 262.375
318 0      $ 164.8667
319 0         $ 134.5
325 0      $ 135.6333
332 0      $ 153.4625
334 0        $ 133.65
337 0         $ 134.5
341 0         $ 263.0
373 0      $ 135.6333
377 0         $ 211.5
380 0       $ 227.525
390 0         $ 120.0
393 0       $ 113.275
435 0         $ 120.0
438 0         $ 263.0
498 0        $ 151.55
505 0         $ 108.9
527 0      $ 221.7792
537 0       $ 106.425
544 0       $ 106.425
550 0      $ 110.8833
557 0       $ 227.525
581 0      $ 110.8833
609 0      $ 153.4625
659 0       $ 113.275
660 0        $ 133.65
679 0      $ 512.3292
689 0      $ 211.3375
698 0      $ 110.8833
700 0       $ 227.525
708 0        $ 151.55
716 0       $ 227.525
730 0      $ 211.3375
737 0      $ 512.3292
742 0       $ 262.375
763 0         $ 120.0
779 0      $ 211.3375
802 0         $ 120.0
856 0      $ 164.8667